package yy.doctor.activity.me;

/**
 * 省市信息
 *
 * @author CaiXiang
 * @since 2017/4/28
 */
public class ProvinceCityData {

    /**
     * 省份信息
     */
    public static final String[] KPROVINCES = {"北京", "上海", "天津", "重庆", "河北", "山西", "内蒙古", "辽宁", "吉林",
            "黑龙江", "江苏", "浙江", "安徽", "福建", "江西", "山东", "河南", "湖北", "湖南", "广东", "广西", "海南", "四川", "贵州",
            "云南", "西藏", "陕西", "甘肃", "青海", "宁夏", "新疆", "台湾", "特别行政区"
    };

    /**
     * 城市信息
     */
    public static final String[][] KCITIES = {

            {"东城区", "西城区", "朝阳区", "海淀区", "丰台区", "石景山区", "门头沟区", "房山区", "大兴区", "通州区", "顺义区", "昌平区", "平谷区",
                    "怀柔区", "密云区", "延庆区"},

            {"黄浦区", "卢湾区", "徐汇区", "长宁区", "普陀区", "闸北区", "虹口区", "杨浦区", "浦东新区", "嘉定区", "宝山区", "崇明县",
                    "松江区", "奉贤区", "青浦区", "金山区", "静安区", "闵行区"},

            {"和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "滨海新区", "东丽区", "西青区", "津南区", "北辰区", "武清区",
                    "宝坻区", "宁河区", "蓟县", "静海区"},

            {"渝中区", "大渡口区", "江北区", "沙坪坝区", "九龙坡区", "南岸区", "北碚区", "渝北区", "巴南区", "涪陵区", "綦江区", "大足区",
                    "长寿区", "江津区", "合川区", "永川区", "南川区", "璧山区", "铜梁区", "潼南区", "荣昌区", "万州区", "梁平县", "城口县",
                    "丰都县", "垫江县", "忠县", "开县", "云阳县", "奉节县", "巫山县", "巫溪县", "黔江区", "武隆县", "石柱土家族自治县",
                    "秀山土家族苗族自治县", "酉阳土家族苗族自治县", "彭水苗族土家族自治县"},

            {"石家庄", "唐山", "秦皇岛", "邯郸", "邢台", "保定", "张家口", "承德", "沧州", "廊坊", "衡水"},

            {"太原", "大同", "阳泉", "长治", "晋城", "朔州", "晋中", "运城", "忻州", "临汾", "吕梁"},

            {"呼和浩特", "包头", "乌海", "赤峰", "通辽", "鄂尔多斯", "呼伦贝尔", "巴彦淖尔", "乌兰察布", "兴安盟", "锡林郭勒盟",
                    "阿拉善盟"},

            {"沈阳", "大连", "鞍山", "抚顺", "本溪", "丹东", "锦州", "营口", "阜新", "辽阳", "盘锦", "铁岭", "朝阳", "葫芦岛"},

            {"长春", "吉林", "四平", "辽源", "通化", "白山", "松原", "白城", "延边朝鲜族自治州", "长白山保护开发区", "梅河口",
                    "公主岭"},

            {"哈尔滨", "齐齐哈尔", "鸡西", "鹤岗", "双鸭山", "大庆", "伊春", "佳木斯", "七台河", "牡丹江", "黑河", "绥化",
                    "大兴安岭地区", "绥芬河", "抚远"},

            {"南京", "无锡", "徐州", "常州", "苏州", "南通", "连云港", "淮安", "盐城", "扬州", "镇江", "泰州", "宿迁"},

            {"杭州", "宁波", "温州", "嘉兴", "湖州", "绍兴", "金华", "衢州", "舟山", "台州", "丽水"},

            {"合肥", "芜湖", "蚌埠", "淮南", "马鞍山", "淮北", "铜陵", "安庆", "黄山", "滁州", "阜阳", "宿州", "六安", "亳州",
                    "池州", "宣城"},

            {"福州", "厦门", "莆田", "三明", "泉州", "漳州", "南平", "龙岩", "宁德"},

            {"南昌", "景德镇", "萍乡", "九江", "新余", "鹰潭", "赣州", "吉安", "宜春", "抚州", "上饶"},

            {"济南", "青岛", "淄博", "枣庄", "东营", "烟台", "潍坊", "济宁", "泰安", "威海", "日照", "莱芜", "临沂", "德州",
                    "聊城", "滨州", "菏泽"},

            {"郑州", "开封", "洛阳", "平顶山", "安阳", "鹤壁", "新乡", "焦作", "濮阳", "许昌", "漯河", "三门峡", "南阳", "商丘",
                    "信阳", "周口", "驻马店", "济源"},

            {"武汉", "黄石", "十堰", "宜昌", "襄阳", "鄂州", "荆门", "孝感", "荆州", "黄冈", "咸宁", "随州", "恩施土家族苗族自治州"},

            {"长沙", "株洲", "湘潭", "衡阳", "邵阳", "岳阳", "常德", "张家界", "益阳", "郴州", "永州", "怀化", "娄底",
                    "湘西土家族苗族自治州"},

            {"广州", "韶关", "深圳", "珠海", "汕头", "佛山", "江门", "湛江", "茂名", "肇庆", "惠州", "梅州", "汕尾", "河源",
                    "阳江", "清远", "东莞", "中山", "潮州", "揭阳", "云浮"},

            {"南宁", "柳州", "桂林", "梧州", "北海", "防城港", "钦州", "贵港", "玉林", "百色", "贺州", "河池", "来宾", "崇左"},

            {"海口", "三亚", "三沙", "儋州"},

            {"成都", "自贡", "攀枝花", "泸州", "德阳", "绵阳", "广元", "遂宁", "内江", "乐山", "南充", "眉山", "宜宾", "广安",
                    "达州", "雅安", "巴中", "资阳", "阿坝藏族羌族自治州", "甘孜藏族自治州", "凉山彝族自治州"},

            {"贵阳", "六盘水", "遵义", "安顺", "铜仁", "毕节", "黔西南布依族苗族自治州", "黔东南苗族侗族自治州", "黔南布依族苗族自治州"},

            {"昆明", "曲靖", "玉溪", "保山", "昭通", "丽江", "普洱", "临沧", "楚雄彝族自治州", "红河哈尼族彝族自治州", "文山壮族苗族自治州",
                    "西双版纳傣族自治州", "大理白族自治州", "德宏傣族景颇族自治州", "怒江傈僳族自治州", "迪庆藏族自治州"},

            {"拉萨", "昌都", "山南", "日喀则", "那曲地区", "阿里地区", "林芝"},

            {"西安", "铜川", "宝鸡", "咸阳", "渭南", "延安", "汉中", "榆林", "安康", "商洛", "杨凌示范区"},

            {"兰州", "嘉峪关", "金昌", "白银", "天水", "武威", "张掖", "平凉", "酒泉", "庆阳", "定西", "陇南", "临夏回族自治州",
                    "甘南藏族自治州"},

            {"西宁", "玉树藏族自治州", "海东", "海北藏族自治州", "黄南藏族自治州", "海南藏族自治州", "果洛藏族自治州", "海西蒙古族藏族自治州"},

            {"银川", "石嘴山", "吴忠", "固原", "中卫"},

            {"乌鲁木齐", "克拉玛依", "吐鲁番", "哈密", "昌吉回族自治州", "博尔塔拉蒙古自治州", "阿克苏地区", "喀什地区", "和田地区",
                    "伊犁哈萨克自治州", "克孜勒苏柯尔克孜自治州", "巴音郭楞蒙古自治州",},

            {"台北", "高雄", "基隆", "台中", "台南", "新竹", "嘉义", "桃园", "新北"},

            {"香港", "澳门"}
    };

}
