package yy.doctor;

/**
 * @author CaiXiang
 * @since 2017/5/2
 */
public class DepartmentsData {

    /**
     * 科室信息
     */
    public static final String[] KDEPARTMENTS = {"内科系统", "儿科系统", "外科系统", "妇产科系统", "医技系统"};

    /**
     * 具体科室信息
     */
    public static final String[][] KDEPARTMENTSDETAIL = {

            {"普内科", "呼吸内科", "心血管内科", "消化内科", "风湿科", "肾内科", "血液科", "内分泌科", "神经内科", "肿瘤内科", "重症医学科", "老年医学科",
                    "急诊内科", "介入科", "皮肤科", "感染科", "放疗科", "中医科", "康复科", "预防保健科", "疼痛科", "生殖科"},

            {"儿科", "儿内科", "儿外科"},

            {"普外科", "肝胆外科", "结直肠外科", "胃外科", "血管外科", "甲状腺外科", "乳腺外科", "胸外科", "心外科", "泌尿外科", "骨科", "神经外科",
                    "烧伤科", "整形外科", "麻醉科", "耳鼻喉科", "眼科", "口腔科", "急诊外科", "胃肠外科"},

            {"妇产科", "妇科", "产科"},

            {"检验科", "放射科", "CT/MR室", "核医学科", "超声科", "病理科", "药剂科", "输血科", "体检科"},

    };

}
